Repository: athy125/Arable
Catalog: lib/l10n/intl_*.arb
Languages: sw

source: Confirm
sw: Thibitisha

source: Cancel
sw: Futa

source: Related articles
sw: Nakala inayofanana

source: Related groups
sw: kikundi fanana

source: Recommendations
sw: Pendekezo

source: My Plot
sw: Shamba langu

source: Discover
sw: Gundua

source: Community
sw: Jamii

source: Join the WhatsApp group and discuss with fellow farmers.
sw: Unganisha wakulima wenzangu kwa kikundi cha Whatsapp

source: Finish
sw: Maliza

source: Clear Selection
sw: Futa Uchaguzi

source: Oops, there was a problem!
sw: Lo, kulikuwa na shida!

source: Retry
sw: Jaribu tena

source: Edit Photo
sw: Hariri Picha

source: No image picked
sw: Hakuna picha iliyochukuliwa

source: No cropped image
sw: Hakuna picha iliyopandwa

source: Your Farm Details
sw: Maelezo yako ya shamba

source: Edit Profile
sw: Hariri Profaili

source: Delete Profile
sw: Futa Profaili

source: Delete
sw: Futa

source: Are you sure you want to delete your profile? Doing so will erase all data and this action cannot be undone.
sw: Una uhakika unataka kufuta wasifu wako? Kufanya hivyo kutafuta data zote na hatua hii haiwezi kutekelezwa.

source: In progress crops
sw: Katika mazao ya maendeleo

source: Edit Farm Details
sw: Hariri Maelezo ya Shambani

source: Completed
sw: Imekamilika

source: Switch Profile
sw: Badilisha wasifu

source: Switch Language
sw: Badilisha lugha

source: Create New Profile
sw: Unda Wasifu Mpya

source: Invite Friends
sw: Alika Marafiki

source: Privacy Policy
sw: Sera ya faragha

source: Terms of use
sw: Masharti ya matumizi

source: Remove Profile
sw: Ondoa Profaili

source: Pick image from gallery
sw: Chagua picha kutoka kwa matunzio

source: Take picture from camera
sw: Chukua picha kutoka kwa kamera

source: Join to the new smart farming app - FarmSmart https://linktogoogleplay.com
sw: Jiunge na programu mpya ya kilimo smart - FarmSmart https://linktogoogleplay.com

source: Are you sure you would like to complete this action?
sw: Una uhakika ungependa kukamilisha kitendo hiki?

source: Rename Crop
sw: Badilishe Mazao

source: Remove Crop
sw: Ondoa Mazao

source: Remove crop
sw: Ondoa mazao

source: Are you sure you want delete the crop?
sw: Je! Una uhakika unataka kufuta mazao?

source: Learn more about
sw: Jifunze zaidi juu

source: Check out this article from the FarmSmart mobile app
sw: Angalia nakala hii kutoka kwa programu ya simu ya FarmSmart

source: View more on the web
sw: Angalia zaidi kwenye wavuti

source: Record a new Cost
sw: Rekodi gharama

source: Record a new Sale
sw: Rekodi mauzo

source: Date
sw: Tarehe

source: Crop
sw: Mazao

source: Today
sw: Leo

source: Select...
sw: Chagua ...

source: Description (optional)...
sw: Maelezo (hiari) ...

source: Reset Process
sw: Rudisha Mchakato

source: Skip
sw: Ruka

source: Confirm Details
sw: Thibitisha Maelezo

source: Option
sw: Chaguo

source: Send
sw: Tuma

source: Message should not be empty
sw: Ujumbe haupaswi kuwa tupu

source: Type a message
sw: Andika ujumbe

source: Provided TEXT is not valid
sw: Maandishi yaliyotolewa sio sawa

source: Provided EMAIL is not valid
sw: Barua pepe iliyotolewa sio sawa

source: Provided PHONE is not valid
sw: Simu iliyotolewa sio halali

source: Provided summary is not correct
sw: Muhtasari uliotolewa sio sawa

source: View Your Details
sw: Angalia Maelezo Yako

source: Add Another Crop
sw: Ongeza Mboo Mwingine

source: View more on the Web
sw: Angalia zaidi kwenye Wavuti

source: Discover much more information using this link...
sw: Gundua habari zaidi ukitumia kiunga hiki ...

source: Day
sw: Siku

source: Upcoming
sw: Inayokuja

source: Stage
sw: Jukwaa

source: In Progress
sw: Inaendelea

source: Complete
sw: Kukamilika

source: Revert to In Progress
sw: Rudi kwa mwendo

source: Begin Stage
sw: Mwanzo jukwaa

source: Please complete previous
sw: Tafadhali kamilisha yaliyopita

source: Mark as complete
sw: Alama ya kakamilisha

source: Begin crop
sw: Anza mazao

source: Complete crop
sw: Mazao kamili

source: Revert crop
sw: Rejea mazao

source: Are you sure you want to mark this stage as in progress?
sw: Je! Una uhakika unataka kuweka alama hatua hii kama inaendelea?

source: Are you sure you want to mark this stage as complete?
sw: Una uhakika unataka kuweka alama hatua hii kuwa kamili?

source: Are you sure you want to market this crop as complete?
sw: Una uhakika unataka kuuza mazao haya kamili?

source: Are you sure you want revert the stage status?
sw: Je! Una uhakika unataka kubadilisha hali ya hatua?

source: assets/responses/farmsmart_chat_ui_flow.json
sw: assets/responses/farmsmart_chat_ui_flow_sw.json

source: Operation already in progress
sw: Operesheni tayari inaendelea

source: Best Soil
sw: Udongo Bora

source: Water Frequency
sw: Mara kwa mara ya Maji

source: Crop Type
sw: Aina ya Mazao

source: Complexity
sw: Ugumu

source: Setup Costs
sw: Gharama za Usanidi

source: Profitability
sw: Faida

source: Companion Plants
sw: Mimea ya Masahaba

source: Non-Companion Plants
sw: Mimea Isiyo ya Ushirika

source: Low
sw: Chini

source: Medium
sw: Kati

source: High
sw: Juu

source: Single
sw: Moja

source: Rotation
sw: Mzunguko

source: Beginner
sw: Mwanzoni

source: Intermediate
sw: Kati

source: Match
sw: Mechi

source: View Details
sw: Kutazama Maelezo

source: Add to Plot
sw: Ongeza kwa shamba

source: Added
sw: Imeongezwa

source: General
sw: Jumla

source: Currency
sw: KSh

source: No description
sw: Hakuna maelezo

source: Record a Cost
sw: Rekodi Gharama

source: Record a Sale
sw: Rekodi mauzo

source: Switch profile
sw: Badilisha wasifu

source: minute read
sw: soma dakika

source: A network and knowledge source for farmers in Kenya
sw: Mtandao na maarifa ya kufulisha wakulima inchini Kenya

source: Get Started
sw: Anza
